## Introduction

Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones.

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage.

Therefore if we can determine if the first stage will land, we can determine the cost of a launch.

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

<a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2022-01-01" target="_blank">Spacex DataSet</a>

In [39]:
import pandas as pd
import csv
import psycopg2

In [40]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## Connect to the database using PostgreSQL database
We tried to establish connection to the cloud database but experienced some difficulty so we decided to use the postgreSQL database. Let us load the SQL extension and establish a connection with the database using the jupyter notebook.

In [73]:
# create connection to postgreSQL database
conn = psycopg2.connect(host='localhost' , database ='DS_IBM', user='postgres',
                       password='123456')

In [74]:
# function to create in postgre database
def create(conn, create_):
    # create cursor object
    cursor.execute(create_) # execute query
    conn.commit() # commit query to database
    print('Table have been created successfull!!!')
    #read(conn)    

# function to insert in postgre database     
def insert(conn, insert_):
    cursor = conn.cursor()
    cursor.execute(insert_)
    conn.commit()
    print('Records have been successfully inserted!!!')
    #read(conn)

In [75]:
cursor = conn.cursor()
# create table SpaceX
create_ = '''
            DROP TABLE IF EXISTS SpaceX;
            CREATE TABLE SpaceX
                (
                    Date DATE NOT NULL,
                    Time TIME NOT NULL,
                    BoosterVersion VARCHAR(50) NOT NULL,
                    LaunchSite VARCHAR(50) NOT NULL,
                    Payload VARCHAR(100) NOT NULL,
                    PayloadMassKG INT NOT NULL,
                    Orbit VARCHAR(50) NOT NULL,
                    Customer VARCHAR(100) NOT NULL,
                    MissionOutcome VARCHAR(50) NOT NULL,
                    LandingOutcome VARCHAR(100) NOT NULL
                );
            '''
create(conn, create_)

Table have been created successfull!!!

In [76]:
with open('Spacex.csv', 'r') as f:
    reader = csv.reader(f)
    next(reader) # Skip the header row.
    for row in reader:
        cursor.execute(
        "INSERT INTO SpaceX VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s)",
        row
    )
conn.commit()
print('CSV file inserted into database successfully!!!')

CSV file inserted into database successfully!!!

### Connect to database

In [80]:
%sql postgresql://postgres:123456@127.0.0.1/DS_IBM

In [81]:
%sql SELECT * FROM spacex LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/DS_IBM
5 rows affected.

[(datetime.date(2010, 4, 6), datetime.time(18, 45), 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 (datetime.date(2010, 8, 12), datetime.time(15, 43), 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 (datetime.date(2012, 5, 22), datetime.time(7, 44), 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 (datetime.date(2012, 8, 10), datetime.time(0, 35), 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 (datetime.date(2013, 1, 3), datetime.time(15, 10), 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

### Task 1

##### Display the names of the unique launch sites  in the space mission

In [83]:
%sql SELECT DISTINCT(launchsite) FROM spacex

 * postgresql://postgres:***@127.0.0.1/DS_IBM
4 rows affected.

[('CCAFS SLC-40',), ('KSC LC-39A',), ('CCAFS LC-40',), ('VAFB SLC-4E',)]

### Task 2

##### Display 5 records where launch sites begin with the string 'CCA'

In [89]:
%%sql
SELECT * FROM spacex 
WHERE launchsite LIKE 'CCA%'
LIMIT 5

 * postgresql://postgres:***@127.0.0.1/DS_IBM
5 rows affected.

[(datetime.date(2010, 4, 6), datetime.time(18, 45), 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 (datetime.date(2010, 8, 12), datetime.time(15, 43), 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 (datetime.date(2012, 5, 22), datetime.time(7, 44), 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 (datetime.date(2012, 8, 10), datetime.time(0, 35), 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 (datetime.date(2013, 1, 3), datetime.time(15, 10), 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

### Task 3

##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [93]:
%%sql
SELECT SUM(payloadmasskg) FROM spaceX
WHERE customer LIKE 'NASA (CRS)'

 * postgresql://postgres:***@127.0.0.1/DS_IBM
1 rows affected.

[(45596,)]

### Task 4

##### Display average payload mass carried by booster version F9 v1.1

In [97]:
%%sql
SELECT AVG(payloadmasskg) FROM spacex
WHERE boosterversion = 'F9 v1.1'

 * postgresql://postgres:***@127.0.0.1/DS_IBM
1 rows affected.

[(Decimal('2928.4000000000000000'),)]

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.

*Hint:Use min function*

In [99]:
%%sql
SELECT DISTINCT(landingoutcome) FROM spacex

 * postgresql://postgres:***@127.0.0.1/DS_IBM
11 rows affected.

[('Failure (parachute)',),
 ('Controlled (ocean)',),
 ('Success (drone ship)',),
 ('Precluded (drone ship)',),
 ('Uncontrolled (ocean)',),
 ('Success (ground pad)',),
 ('Success',),
 ('Failure',),
 ('No attempt ',),
 ('Failure (drone ship)',),
 ('No attempt',)]

In [100]:
%%sql
SELECT MIN(Date) AS FirstSuccessfull_landing_date
        FROM SpaceX
        WHERE LandingOutcome LIKE 'Success (ground pad)'

 * postgresql://postgres:***@127.0.0.1/DS_IBM
1 rows affected.

[(datetime.date(2015, 12, 22),)]

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [102]:
%%sql
SELECT boosterversion FROM spacex
WHERE landingoutcome LIKE 'Success (drone ship)'
AND (payloadmasskg BETWEEN 4000 AND 6000)

 * postgresql://postgres:***@127.0.0.1/DS_IBM
4 rows affected.

[('F9 FT B1022',), ('F9 FT B1026',), ('F9 FT  B1021.2',), ('F9 FT  B1031.2',)]

### Task 7

##### List the total number of successful and failure mission outcomes

In [113]:
%%sql
SELECT COUNT(MissionOutcome) AS SuccessOutcome
        FROM SpaceX
        WHERE MissionOutcome LIKE 'Success%'

 * postgresql://postgres:***@127.0.0.1/DS_IBM
1 rows affected.

[(100,)]

In [114]:
%%sql
 SELECT COUNT(MissionOutcome) AS FailureOutcome
        FROM SpaceX
        WHERE MissionOutcome LIKE 'Failure%'

 * postgresql://postgres:***@127.0.0.1/DS_IBM
1 rows affected.

[(1,)]

### Task 8

##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [115]:
%%sql
 SELECT BoosterVersion, PayloadMassKG
        FROM SpaceX
        WHERE PayloadMassKG = (
                                SELECT MAX(PayloadMassKG)
                                FROM SpaceX
                                )
        ORDER BY BoosterVersion

 * postgresql://postgres:***@127.0.0.1/DS_IBM
12 rows affected.

[('F9 B5 B1048.4', 15600),
 ('F9 B5 B1048.5', 15600),
 ('F9 B5 B1049.4', 15600),
 ('F9 B5 B1049.5', 15600),
 ('F9 B5 B1049.7 ', 15600),
 ('F9 B5 B1051.3', 15600),
 ('F9 B5 B1051.4', 15600),
 ('F9 B5 B1051.6', 15600),
 ('F9 B5 B1056.4', 15600),
 ('F9 B5 B1058.3 ', 15600),
 ('F9 B5 B1060.2 ', 15600),
 ('F9 B5 B1060.3', 15600)]

### Task 9

##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

Note: SQLLite does not support monthnames. So you need to use  substr(Date, 4, 2) as month to get the months and substr(Date,7,4)='2015' for year.

In [117]:
%%sql
 SELECT BoosterVersion, LaunchSite, LandingOutcome
        FROM SpaceX
        WHERE LandingOutcome LIKE 'Failure (drone ship)'
            AND Date BETWEEN '2015-01-01' AND '2015-12-31'

 * postgresql://postgres:***@127.0.0.1/DS_IBM
2 rows affected.

[('F9 v1.1 B1012', 'CCAFS LC-40', 'Failure (drone ship)'),
 ('F9 v1.1 B1015', 'CCAFS LC-40', 'Failure (drone ship)')]

### Task 10

##### Rank the  count of  successful landing_outcomes between the date 04-06-2010 and 20-03-2017 in descending order.

In [125]:
%%sql
SELECT landingoutcome, count(landingoutcome) FROM spacex
WHERE Date BETWEEN '2010-06-04' AND '2017-03-20'
AND landingoutcome LIKE 'Success%'
GROUP BY LandingOutcome
ORDER BY COUNT(LandingOutcome) DESC

 * postgresql://postgres:***@127.0.0.1/DS_IBM
2 rows affected.

[('Success (drone ship)', 6), ('Success (ground pad)', 5)]